const dict = {
    locales: {
        en: 'انگلیسی',
        fa: 'فارسی',
        ar: 'عربی',
        ru: 'روسی',
        es: 'اسپانیایی',
        id: 'اندونزیایی',
        hi: 'هندی',
        zhHans: 'چینی',
    },
    home: {
        title: 'باتری Tonkeeper',
        description: 'باتری Tonkeeper ویژگی‌ای است که هزینه‌های تراکنش را زمانی که موجودی TON حساب صفر است پرداخت می‌کند. باتری هزینه‌های پرداخت، استیکینگ، مبادله و موارد دیگر را با هر نوع توکن و NFT پوشش می‌دهد.',
        header: {
            menu: {
                home: 'خانه',
                faq: 'سوالات متداول',
                support: 'پشتیبانی',
                github: 'گیت‌هاب',
            },
            language: 'زبان',
            hero: {
                title: 'باتری Tonkeeper',
                typewriter: [
                    'پرداخت‌ها و مبادلات یکپارچه',
                    'انتقال NFTها',
                    'تأمین مالی با ارزهای دیجیتال',
                    'تأمین مالی با خرید درون‌برنامه‌ای',
                ],
                description: 'باتری Tonkeeper یک مانع را برای تازه‌واردان حذف می‌کند: می‌توانید یک استیبل‌کوین یا یک NFT بگیرید و بلافاصله از آنها استفاده کنید بدون اینکه نیاز به دریافت ارزهای بومی برای پرداخت هزینه‌های گاز داشته باشید. نیازی به رفتن به صرافی، گذراندن مراحل KYC، وارد کردن جزئیات زیاد برای خرید مقدار تصادفی ارزهایی که فکر نمی‌کردید نیاز دارید، نیست.',
            },
        },
        integratedTransfers: {
            title: 'انتقال‌ها و مبادلات یکپارچه',
            description: 'با باتری Tonkeeper دیگر نگران هزینه‌های گاز نباشید. باتری خود را با یک کارت بانکی یا یک استیبل‌کوین شارژ کنید و بلافاصله از تمام ویژگی‌های کیف پول خود استفاده کنید.',
            items: {
                TON: {
                    title: 'TON',
                    subtitle: 'مبادله TON با دیگر توکن‌ها به راحتی',
                },
                NOT: {
                    title: 'NOT',
                    subtitle: 'انتقال NOT بدون نیاز به TON',
                },
                USDT: {
                    title: 'USDT',
                    subtitle: 'انتقال USDT بدون نیاز به TON',
                },
                NFT: {
                    title: 'NFT',
                    subtitle: 'تجارت NFTها بدون نیاز به TON',
                },
            }
        },
        comparison: {
            title: 'پرداخت‌های بدون گاز و 🔥 W5',
            description: 'با پرداخت‌های بدون گاز نیازی به شارژ باتری نیست، هزینه‌های تراکنش مستقیماً از موجودی USDT پرداخت می‌شود.',
            items: {
                battery: {
                    title: 'باتری',
                    description: 'باتری Tonkeeper ویژگی‌ای است که هزینه‌های تراکنش را زمانی که موجودی TON حساب صفر است پرداخت می‌کند. باتری هزینه‌های پرداخت، استیکینگ، مبادله و موارد دیگر را با هر نوع توکن و NFT پوشش می‌دهد.',
                    pros: [
                        'کار با انواع مختلف دارایی‌ها',
                        'کار در کیف پول‌های W4 و W5',
                    ],
                },
                w5: {
                    title: 'کیف پول W5',
                    description: 'W5 استاندارد باز کیف پولی است که توسط تیم Tonkeeper توسعه یافته است. در W5 نیازی به شارژ باتری نیست، هزینه‌های تراکنش مستقیماً از موجودی USDT پرداخت می‌شود.',
                    pros: [
                        '2 برابر سریع‌تر و 1.5 برابر ارزان‌تر از هر کیف پول دیگری',
                    ],
                    cons: [
                        'محدود به فقط USDT و NOT',
                        'نیاز به کیف پول W5',
                    ],
                },
            },
        },
        recharge: {
            title: 'شارژ آسان',
            description: 'می‌توانید باتری را با یک ضربه از طریق خرید درون‌برنامه‌ای، یا با TON یا استیبل‌کوین‌ها شارژ کنید. چند دلار استیبل‌کوین یا TON به آدرس خاصی: battery.ton ارسال کنید و به طور خودکار به حساب شما اعمال می‌شود.',
            items: {
                crypto: {
                    title: 'ارز دیجیتال',
                    description: 'می‌توانید باتری را با TON یا استیبل‌کوین‌هایی مانند USDT شارژ کنید',
                    symbol: {
                        USDT: 'شارژ با USDT',
                        TON: 'شارژ با TON',
                    },
                },
                inAppPurchase: {
                    title: 'خرید درون‌برنامه‌ای',
                    description: 'می‌توانید باتری را از طریق خرید درون‌برنامه‌ای شارژ کنید',
                    symbol: {
                        title: 'Apple Pay',
                        cancel: 'لغو',
                        product: 'بسته کوچک',
                        description: 'Tonkeeper - کیف پول TON',
                        confirm: 'تأیید با دکمه جانبی',
                    },
                },
                wallet: {
                    title: 'کیف پول',
                    description: 'می‌توانید باتری را با واریز به battery.ton شارژ کنید',
                },
            }
        },
        plans: {
            title: 'طرح‌ها و قیمت‌گذاری',
            description: 'باتری Tonkeeper به صورت شارژها تعیین می‌شود، هر شارژ هزینه یک تراکنش ساده انتقال TON را پوشش می‌دهد. تراکنش‌های پیچیده‌تر ممکن است 5، 10 یا بیشتر شارژ مصرف کنند.',
            charges: (amount: number) => `${amount.toString()} شارژ`,
            items: {
                small: {
                    title: 'کوچک',
                },
                medium: {
                    title: 'متوسط',
                },
                large: {
                    title: 'بزرگ',
                },
            }
        },
        security: {
            title: 'دسترسی و حفاظت',
            description: 'باتری Tonkeeper راهی دسترس‌پذیر و امن برای پرداخت هزینه‌های تراکنش در بلاکچین TON است، با تمرکز بر تجربه کاربری و دسترسی آسان.',
            items: {
                accessible: {
                    title: 'دسترسی',
                    description: 'باتری Tonkeeper راه‌حلی اختیاری و جایگزین برای نیاز به TON برای تراکنش‌ها در بلاکچین TON فراهم می‌کند، با ارائه گزینه‌های متعدد برای پرداخت هزینه‌های تراکنش شما.',
                },
                security: {
                    title: 'امنیت',
                    description: 'باتری Tonkeeper حریم خصوصی و امنیت شما را تضمین می‌کند، با استفاده از رمزنگاری درجه یک، شارژهای شما را ایمن نگه می‌دارد و به شما آرامش خاطر می‌دهد هنگام استفاده از تمام ویژگی‌های کیف پول خود.',
                },
            }
        },
        FAQ: {
            title: 'سوالات متداول',
            items: [
                {
                    title: 'آیا هزینه‌های گاز از Tonkeeper حذف شده‌اند؟',
                    description: 'خیر. شبکه TON برای هر تراکنش هزینه‌ای در قالب تونکوین می‌گیرد. باتری و بدون گاز ویژگی‌های اختیاری هستند که پرداخت همان هزینه‌ها را بدون استفاده از تونکوین‌ها ساده‌تر می‌کنند.',
                },
                {
                    title: 'باتری Tonkeeper چگونه کار می‌کند؟',
                    description: 'باتری Tonkeeper به صورت شارژها تعیین می‌شود، هر شارژ هزینه یک تراکنش ساده انتقال TON را پوشش می‌دهد. تراکنش‌های پیچیده‌تر ممکن است 5، 10 یا بیشتر شارژ مصرف کنند. می‌توانید باتری را با یک ضربه از طریق خرید درون‌برنامه‌ای، با TON، استیبل‌کوین‌ها و Notcoin اکنون شارژ کنید! فقط برنامه Tonkeeper را باز کنید، به تنظیمات بروید و باتری خود را با استفاده از TON، USDT، یا NOT شارژ کنید.',
                },
                {
                    title: 'چگونه می‌توانم باتری را در Tonkeeper خود استفاده کنم؟',
                    description: 'Tonkeeper را در iOS و Android به نسخه 4.3 به‌روزرسانی کنید، سپس باتری را در تنظیمات → باتری شارژ کنید. پس از شارژ، وضعیت باتری در صفحه اصلی نمایش داده می‌شود.',
                },
                {
                    title: 'چگونه می‌توانم از کیف پول W5 در Tonkeeper خود استفاده کنم؟',
                    description: 'Tonkeeper را در iOS و Android به نسخه 4.6.1 به‌روزرسانی کنید، سپس روی “USDT” ضربه بزنید و “Try W5 Wallet” را انتخاب کنید. کیف پول “W5” را به همراه کیف پول فعلی اضافه کنید و مقداری USDT به آن ارسال کنید، اکنون می‌توانید با USDT و Notcoin بدون TON پرداخت کنید!',
                },
                {
                    title: 'چگونه می‌توانم از USDT برای شارژ باتری استفاده کنم؟',
                    description: 'پس از دریافت USDT، می‌توانید چند دلار به battery.ton ارسال کنید و باتری شما در چند ثانیه شارژ خواهد شد. پس از آن می‌توانید با USDT پرداخت کنید و نگران هزینه‌ها نباشید — باتری آنها را پوشش خواهد داد! این واقعاً جادویی است: حتی هزینه اولین تراکنش به battery.ton نیز توسط باتری پرداخت می‌شود (* برای پرداخت‌های بالای 10 USDT).',
                },
                {
                    title: 'چگونه می‌توانم از NOT برای شارژ باتری استفاده کنم؟',
                    description: 'برنامه Tonkeeper را باز کنید، تنظیمات را انتخاب کنید و باتری خود را شارژ کنید. برای شارژ باتری نیاز به ارسال حداقل 300 Notcoins دارید. می‌توانید آن را بیشتر شارژ کنید و NOT را برای TON یا USDT بدون خرید TON در صرافی مبادله کنید.',
                },
            ],
            platform: {
                title: 'پلتفرم سوالات متداول Tonkeeper',
                description: "نمی‌توانید پاسخ خود را پیدا کنید؟ به مرکز کمک ما مراجعه کنید.",
            }
        },
        footer: {
            menu: {
                company: {
                    title: 'شرکت',
                    items: {
                        news: 'اخبار',
                        chat: 'چت',
                        twitter: 'توییتر',
                    },
                },
                resources: {
                    title: 'منابع',
                    items: {
                        faq: 'سوالات متداول',
                        support: 'پشتیبانی',
                        suggest: 'پیشنهاد ویژگی',
                    },
                },
                developers: {
                    title: 'توسعه‌دهندگان',
                    items: {
                        documentation: 'مستندات',
                        bugBounty: 'جایزه باگ',
                        github: 'گیت‌هاب',
                    },
                },
                legal: {
                    title: 'قانونی',
                    items: {
                        terms: 'شرایط',
                        privacy: 'حریم خصوصی',
                    },
                },
            },
            copyright: {
                primary: `© ${new Date().getFullYear()} Tonkeeper. همه حقوق محفوظ است.`,
                secondary: 'همه علامت‌های تجاری متعلق به صاحبان مربوطه می‌باشد.',
            },
        },
    }
};

export {
    dict
};
