const dict = {
    locales: {
        en: 'अंग्रेज़ी',
        fa: 'फ़ारसी',
        ar: 'अरबी',
        ru: 'रूसी',
        es: 'स्पेनिश',
        id: 'इंडोनेशियाई',
        hi: 'हिन्दी',
        zhHans: 'चीनी',
    },
    home: {
        title: 'टॉन्कीपर बैटरी',
        description: 'टॉन्कीपर बैटरी एक विशेषता है जो एक खाते का TON बैलेंस शून्य होने पर ट्रांजेक्शन शुल्क का भुगतान करती है। बैटरी भुगतान, स्टेकिंग, स्वैप और अधिक को कवर करती है किसी भी टोकन और NFT के साथ।',
        header: {
            menu: {
                home: 'मुख्य पृष्ठ',
                faq: 'सामान्य प्रश्न',
                support: 'सहायता',
                github: 'GitHub',
            },
            language: 'भाषा',
            hero: {
                title: 'टॉन्कीपर बैटरी',
                typewriter: [
                    'समेकित भुगतान और स्वैप',
                    'NFT ट्रांसफर',
                    'क्रिप्टो से फंडिंग',
                    'इन-ऐप खरीद के साथ फंडिंग',
                ],
                description: 'टॉन्कीपर बैटरी नवागंतुकों के लिए एक बाधा को हटा देती है: आप एक स्थिर मुद्रा या NFT प्राप्त कर सकते हैं और उन्हें तुरंत उपयोग कर सकते हैं बिना गैस का भुगतान करने के लिए मूल सिक्कों को प्राप्त किए। आपको एक एक्सचेंज पर जाने की, KYC जांच पास करने की, बहुत सारे विवरण दर्ज करने की आवश्यकता नहीं होगी केवल उन्हीं सिक्कों की एक रैंडम राशि खरीदने के लिए जिन्हें आपने सोचा नहीं था कि आपको आवश्यकता है।',
            },
        },
        integratedTransfers: {
            title: 'समेकित ट्रांसफर और स्वैप',
            description: 'टॉन्कीपर बैटरी के साथ आपको गैस की चिंता कभी नहीं करनी होगी। अपने बैटरी को एक बैंकिंग कार्ड या एक स्थिर मुद्रा के साथ टॉप अप करें, और तुरंत अपने वॉलेट की सभी सुविधाओं का उपयोग करें।',
            items: {
                TON: {
                    title: 'TON',
                    subtitle: 'TON को अन्य टोकनों के साथ आसानी से स्वैप करें',
                },
                NOT: {
                    title: 'NOT',
                    subtitle: 'TON के बिना NOT को ट्रांसफर करें',
                },
                USDT: {
                    title: 'USDT',
                    subtitle: 'TON के बिना USDT को ट्रांसफर करें',
                },
                NFT: {
                    title: 'NFT',
                    subtitle: 'TON के बिना NFT का व्यापार करें',
                },
            }
        },
        comparison: {
            title: 'गैसलेस भुगतान और 🔥 W5',
            description: 'गैसलेस भुगतान के साथ आपको बैटरी को चार्ज करने की आवश्यकता नहीं है, ट्रांजेक्शन शुल्क सीधे USDT बैलेंस से भुगतान किए जाते हैं।',
            items: {
                battery: {
                    title: 'बैटरी',
                    description: 'टॉन्कीपर बैटरी एक विशेषता है जो एक खाते का TON बैलेंस शून्य होने पर ट्रांजेक्शन शुल्क का भुगतान करती है। बैटरी भुगतान, स्टेकिंग, स्वैप और अधिक को कवर करती है किसी भी टोकन और NFT के साथ।',
                    pros: [
                        'अनेक विभिन्न प्रकार की संपत्तियों के साथ काम करता है',
                        'W4 और W5 वॉलेट पर काम करता है',
                    ],
                },
                w5: {
                    title: 'W5 वॉलेट',
                    description: 'W5 एक ओपन वॉलेट मानक है जिसे टॉन्कीपर टीम द्वारा विकसित किया गया है। W5 में उपयोगकर्ताओं को बैटरी चार्ज करने की आवश्यकता नहीं होती है, ट्रांजेक्शन शुल्क सीधे USDT बैलेंस से भुगतान किए जाते हैं।',
                    pros: [
                        'किसी भी अन्य वॉलेट की तुलना में 2x तेजी और 1.5x सस्ता',
                    ],
                    cons: [
                        'केवल USDT और NOT तक सीमित',
                        'W5 वॉलेट की आवश्यकता होती है',
                    ],
                },
            },
        },
        recharge: {
            title: 'आसानी से रिचार्ज करें',
            description: 'आप इन-ऐप खरीदारी का उपयोग करके या TON या स्थिर मुद्राओं के साथ बैटरी को एक टैप से चार्ज कर सकते हैं। कुछ डॉलर की स्थिर मुद्राएं या TON एक विशेष पते पर भेजें: battery.ton और यह स्वचालित रूप से आपके खाते पर चार्ज लागू करेगा।',
            items: {
                crypto: {
                    title: 'क्रिप्टो',
                    description: 'आप TON या स्थिर मुद्राओं जैसे USDT के साथ बैटरी को चार्ज कर सकते हैं',
                },
                inAppPurchase: {
                    title: 'इन-ऐप खरीदारी',
                    description: 'आप इन-ऐप खरीदारी के माध्यम से बैटरी को चार्ज कर सकते हैं',
                },
                wallet: {
                    title: 'वॉलेट',
                    description: 'आप battery.ton में जमा करके बैटरी को चार्ज कर सकते हैं',
                },
            }
        },
        plans: {
            title: 'योजनाएं और मूल्य निर्धारण',
            description: 'टॉन्कीपर बैटरी चार्ज में मापी जाती है, प्रत्येक चार्ज एक साधारण TON ट्रांसफर ट्रांजेक्शन की शुल्क को कवर करती है। अधिक जटिल ट्रांजेक्शन में 5, 10 या अधिक चार्ज का उपभोग हो सकता है।',
            charges: (amount: number) => `${amount.toString()} चार्ज`,
            items: {
                small: {
                    title: 'छोटा',
                },
                medium: {
                    title: 'मध्यम',
                },
                large: {
                    title: 'बड़ा',
                },
            }
        },
        security: {
            title: 'सुलभ और सुरक्षित',
            description: 'टॉन्कीपर बैटरी TON ब्लॉकचेन पर ट्रांजेक्शन शुल्क का भुगतान करने का एक सुलभ और सुरक्षित तरीका है, जिसमें उपयोगकर्ता अनुभव और पहुंच में आसानी पर ध्यान केंद्रित किया गया है।',
            items: {
                accessible: {
                    title: 'पहुंच',
                    description: 'टॉन्कीपर बैटरी ट्रांजेक्शन शुल्क का भुगतान करने के लिए TON की आवश्यकता के लिए एक वैकल्पिक और वैकल्पिक समाधान प्रदान करती है, जो आपको ट्रांजेक्शन शुल्क का भुगतान करने के लिए कई विकल्प प्रदान करती है।',
                },
                security: {
                    title: 'सुरक्षा',
                    description: 'टॉन्कीपर बैटरी आपकी गोपनीयता और सुरक्षा सुनिश्चित करती है, आपके चार्ज को शीर्ष स्तरीय एन्क्रिप्शन के माध्यम से सुरक्षित रखती है, जिससे आप अपने वॉलेट की सभी सुविधाओं का उपयोग करते समय मानसिक शांति प्राप्त कर सकते हैं।',
                },
            }
        },
        FAQ: {
            title: 'सामान्य प्रश्न',
            items: [
                {
                    title: 'क्या टॉन्कीपर से गैस शुल्क हटा दिए गए हैं?',
                    description: 'नहीं। TON नेटवर्क प्रत्येक ट्रांजेक्शन के लिए एक शुल्क लेता है, जो Toncoins में भुगतान किया जाता है। बैटरी और गैसलेस वही शुल्क बिना Toncoins का उपयोग किए भुगतान को सरल बनाते हैं।',
                },
                {
                    title: 'टॉन्कीपर बैटरी कैसे काम करती है?',
                    description: 'टॉन्कीपर बैटरी चार्ज में मापी जाती है, प्रत्येक चार्ज एक साधारण TON ट्रांसफर ट्रांजेक्शन की शुल्क को कवर करती है। अधिक जटिल ट्रांजेक्शन में 5, 10 या अधिक चार्ज का उपभोग हो सकता है। आप इन-ऐप खरीदारी का उपयोग करके, TON, स्थिर मुद्राएं, और Notcoin के साथ बैटरी को एक टैप से चार्ज कर सकते हैं। बस टॉन्कीपर ऐप खोलें, सेटिंग्स पर जाएं, और TON, USDT, या NOT का उपयोग करके अपनी बैटरी को टॉप अप करें।',
                },
                {
                    title: 'मैं अपने टॉन्कीपर पर बैटरी का उपयोग कैसे कर सकता हूँ?',
                    description: 'iOS और Android पर टॉन्कीपर को संस्करण 4.3 में अपडेट करें, फिर सेटिंग्स → बैटरी में बैटरी को टॉप अप करें। एक बार चार्ज हो जाने पर, मुख्य स्क्रीन पर बैटरी की स्थिति दिखाई देगी।',
                },
                {
                    title: 'मैं अपने टॉन्कीपर पर W5 वॉलेट का उपयोग कैसे कर सकता हूँ?',
                    description: 'iOS और Android पर टॉन्कीपर को संस्करण 4.6.1 में अपडेट करें, फिर "USDT" टैप करें और "W5 वॉलेट आज़माएं" चुनें। वर्तमान वॉलेट के साथ "W5" वॉलेट जोड़ें और उसमें कुछ USDT भेजें, अब आप TON के बिना USDT और Notcoin के साथ भुगतान कर सकते हैं!',
                },
                {
                    title: 'मैं बैटरी को चार्ज करने के लिए USDT का उपयोग कैसे कर सकता हूँ?',
                    description: 'एक बार जब आप USDT प्राप्त करते हैं, तो आप battery.ton पर कुछ डॉलर भेज सकते हैं और कुछ ही सेकंड में अपनी बैटरी को रिचार्ज कर सकते हैं। उसके बाद आप USDT के साथ भुगतान कर सकते हैं और शुल्क की चिंता नहीं करनी होगी - बैटरी इसका ध्यान रखेगी! यह असली जादू है: यहां तक कि battery.ton के लिए पहली ट्रांजेक्शन का शुल्क भी बैटरी द्वारा भुगतान किया जाएगा (* 10 usdt से अधिक के भुगतान के लिए)।',
                },
                {
                    title: 'मैं बैटरी को चार्ज करने के लिए NOT का उपयोग कैसे कर सकता हूँ?',
                    description: 'टॉन्कीपर ऐप खोलें, सेटिंग्स चुनें और अपनी बैटरी को टॉप अप करें। बैटरी को चार्ज करने के लिए आपको कम से कम 300 Notcoins भेजने की आवश्यकता है। आप इसे अधिक चार्ज कर सकते हैं और बिना एक्सचेंज पर TON खरीदे NOT को TON या USDT के साथ स्वैप कर सकते हैं।',
                },
            ],
            platform: {
                title: 'टॉन्कीपर FAQ प्लेटफॉर्म',
                description: "अपना उत्तर नहीं पा रहे हैं? हमारे सहायता केंद्र पर जाएं।",
            }
        },
        footer: {
            menu: {
                company: {
                    title: 'कंपनी',
                    items: {
                        news: 'समाचार',
                        chat: 'चैट',
                        twitter: 'ट्विटर',
                    },
                },
                resources: {
                    title: 'संसाधन',
                    items: {
                        faq: 'FAQ',
                        support: 'सहायता',
                        suggest: 'विशेषता का सुझाव दें',
                    },
                },
                developers: {
                    title: 'डेवलपर्स',
                    items: {
                        documentation: 'प्रलेखन',
                        bugBounty: 'बग बाउंटी',
                        github: 'GitHub',
                    },
                },
                legal: {
                    title: 'कानूनी',
                    items: {
                        terms: 'नियम और शर्तें',
                        privacy: 'गोपनीयता',
                    },
                },
            },
            copyright: {
                primary: `© ${new Date().getFullYear()} टॉन्कीपर। सर्वाधिकार सुरक्षित।`,
                secondary: 'सभी ट्रेडमार्क उनके संबंधित मालिकों की संपत्ति हैं।',
            },
        },
    }
};

export {
    dict
};
